Documents/Расписание.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>Расписание</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>InformationRegister.ДомашнееЗадание</xr:Item>
				<xr:Item>InformationRegister.Успеваемость</xr:Item>
				<xr:Item>AccumulationRegister.Посещение</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Предмет</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Предметы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>РасписаниеВТаблице</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Начало</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Time</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Конец</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Time</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Предмет</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Предметы</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДЗ</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>300</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Оценка</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>1</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

CommonForms/Планировщик/Ext/Form/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ЗаполнитьПланировщикНаСервере();        
	
	                  Доска.ЕдиницаПериодическогоВарианта = ТипЕдиницыШкалыВремени.Час;    
	Доска.КратностьПериодическогоВарианта = 24;   
	
	Доска.ОтступСНачалаПереносаШкалыВремени = 9;
	Доска.ОтступСКонцаПереносаШкалыВремени =5;  
	
	Доска.ВыравниватьГраницыЭлементовПоШкалеВремени=Ложь;              
	
	Доска.ФорматПеренесенныхЗаголовковШкалыВремени = "ДФ='дддд, д ММММ гггг'";
	
	Доска.ТекущиеПериодыОтображения.Очистить();
	НачалоПериода=НачалоНедели(ТекущаяДата());
	КонецПериода=КонецНедели(ТекущаяДата())-1 * 24*60*60;
	Доска.ТекущиеПериодыОтображения.Добавить(НачалоПериода, КонецПериода);     
	Заголовок = "Расписание " + ПредставлениеПериода(НачалоПериода, КонецПериода);
КонецПроцедуры 


&НаСервере
Процедура ЗаполнитьПланировщикНаСервере()
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	РасписаниеРасписаниеВТаблице.Ссылка.Дата КАК Дата,
		|	РасписаниеРасписаниеВТаблице.НомерСтроки КАК ПорядковыйНомер,
		|	РасписаниеРасписаниеВТаблице.Предмет.Представление КАК Предмет,
		|	РасписаниеРасписаниеВТаблице.Ссылка КАК УчебныйДень,
		|	РасписаниеРасписаниеВТаблице.Предмет.ВидЗанятий КАК ВидЗанятий,
		|	РасписаниеРасписаниеВТаблице.ДЗ КАК ДЗ
		|ИЗ
		|	Документ.Расписание.РасписаниеВТаблице КАК РасписаниеРасписаниеВТаблице
		|
		|УПОРЯДОЧИТЬ ПО
		|	Дата,
		|	ПорядковыйНомер";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		Если НРег(Выборка.Предмет) = "null" Тогда
			Продолжить; 
		КонецЕсли;
		ДатаНачала = НачалоДня(Выборка.Дата) + НачалоПары(Выборка.ПорядковыйНомер);
		ДатаКонца = НачалоДня(Выборка.Дата) + КонецПары(Выборка.ПорядковыйНомер);
		НовыйЭлемент = Доска.Элементы.Добавить(ДатаНачала, ДатаКонца);
		НовыйЭлемент.Текст = Выборка.Предмет + Символы.ПС + Выборка.ДЗ;   
		НовыйЭлемент.Значение = Выборка.УчебныйДень; 
		
		Если ДатаНачала >= ТекущаяДата() Тогда
			НовыйЭлемент.ЦветФона = WebЦвета.Белый;
			НовыйЭлемент.ЦветРамки = WebЦвета.Черный;
		Иначе
			 НовыйЭлемент.ЦветФона=ЦветПары(Выборка.ВидЗанятий); 
		 КонецЕсли;
	КонецЦикла;
	
	//}}КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА

КонецПроцедуры  
&НаСервере
Функция ЦветПары(ВидЗанятий)
	Если ВидЗанятий = "лекция" Тогда
		Возврат WebЦвета.Бирюзовый;
	ИначеЕсли ВидЗанятий = "практика" или ВидЗанятий = "пракктика" Тогда
		Возврат WebЦвета.Кирпичный;
	Иначе
		Возврат Новый Цвет();
	КонецЕсли;
КонецФункции
&НаСервере
Функция НачалоПары(ПорядковыйНомер)
	Если ПорядковыйНомер = 1 Тогда
		Возврат 9*60*60+0*60; 
	ИначеЕсли ПорядковыйНомер = 2 Тогда
		Возврат 10*60*60+40*60;
	ИначеЕсли ПорядковыйНомер = 3 Тогда
		Возврат 13*60*60+00*60;
	ИначеЕсли ПорядковыйНомер = 4 Тогда
		Возврат 14*60*60+45*60;
    ИначеЕсли ПорядковыйНомер = 5 Тогда
		Возврат 16*60*60+30*60;
	Иначе
		Возврат 0;
	КонецЕсли
КонецФункции
&НаСервере
Функция КонецПары(ПорядковыйНомер)
	Если ПорядковыйНомер = 1 Тогда
		Возврат 10*60*60+30*60; 
	ИначеЕсли ПорядковыйНомер = 2 Тогда
		Возврат 12*60*60+20*60;
	ИначеЕсли ПорядковыйНомер = 3 Тогда
		Возврат 14*60*60+35*60;
	ИначеЕсли ПорядковыйНомер = 4 Тогда
		Возврат 16*60*60+20*60;
    ИначеЕсли ПорядковыйНомер = 5 Тогда
		Возврат 18*60*60+05*60;
	Иначе
		Возврат 0;
	КонецЕсли
КонецФункции

&НаКлиенте
Процедура ДоскаПередНачаломБыстрогоРедактирования(Элемент, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	ПараметрФормы = Новый Структура("Ключ", Элемент.ВыделенныеЭлементы[0].Значение);
	ОткрытьФорму("Документ.Расписание.ФормаОбъекта", ПараметрФормы);
КонецПроцедуры

&НаКлиенте
Процедура ДоскаПриСменеТекущегоПериодаОтображения(Элемент, ТекущиеПериодыОтображения, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;    
	НовыйПериод = ТекущиеПериодыОтображения[0];
	Доска.ТекущиеПериодыОтображения.Очистить();
	НачалоПериода=НачалоНедели(ТекущаяДата());
	КонецПериода=КонецНедели(ТекущаяДата())-1 * 24*60*60;
	Доска.ТекущиеПериодыОтображения.Добавить(НачалоПериода, КонецПериода);     
	Заголовок = "Расписание " + ПредставлениеПериода(НачалоПериода, КонецПериода);	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	Если ИмяСобытия = "Учебный день записан" Тогда
		Доска.Элементы.Очистить();
		ЗаполнитьПланировщикНаСервере();
	КонецЕсли;
	
КонецПроцедуры
